---
kind: property
id: P:Autodesk.Revit.DB.PrintManager.PrinterName
source: html/a47e3440-fa81-5623-895b-3fbc4247b3d7.htm
---
# Autodesk.Revit.DB.PrintManager.PrinterName Property

The name of the current printer.

## Syntax (C#)
```csharp
public string PrinterName { get; }
```